src/__tests__/__mock_responses__/currency_conversion_quote_response.json

{
    "data": {
        "dccSessionId": "1a2b3c4d5e6f7g8h9i0j",
        "result": {
          "result": "Allowed"
        },
        "proposal": {
          "baseAmount": {
            "amount": 1000,
            "currencyCode": "AUD"
          },
          "targetAmount": {
            "amount": 691,
            "currencyCode": "USD"
          },
          "rate": {
            "exchangeRate": 0.69147854,
            "invertedExchangeRate": 1.446176478,
            "markUpRate": 2,
            "quotationDateTime": "2024-07-15T07:30:00Z",
            "source": "Online Payments"
          },
          "disclaimerReceipt": "I have been offered a choice of currencies and I accept the final amount in transaction currency.\n\nCurrency conversion provided by Online Payments",
          "disclaimerDisplay": "I have been offered a choice of currencies and I accept the final amount in transaction currency.\n\nCurrency conversion provided by Online Payments"
        }
      }
}