src/__tests__/__mock_responses__/surcharge_calculation_response_with_surcharge.json

{
    "data": {
        "surcharges": [
            {
                "paymentProductId": 1,
                "result": "OK",
                "netAmount": {
                    "amount": 1000,
                    "currencyCode": "USD"
                },
                "surchargeAmount": {
                    "amount": 366,
                    "currencyCode": "USD"
                },
                "totalAmount": {
                    "amount": 1366,
                    "currencyCode": "USD"
                },
                "surchargeRate": {
                    "surchargeProductTypeId": "PAYMENT_PRODUCT_TYPE_ID",
                    "surchargeProductTypeVersion": "1a2b3c-4d5e-6f7g8h-9i0j",
                    "adValoremRate": 3.3,
                    "specificRate": 333
                }
            }
        ]
    }
}