src/__tests__/__mock_responses__/surcharge_calculation_response_without_surcharge.json

{
    "data": {
        "surcharges": [
            {
                "paymentProductId": 2,
                "result": "NO_SURCHARGE",
                "netAmount": {
                    "amount": 1000,
                    "currencyCode": "USD"
                },
                "surchargeAmount": {
                    "amount": 0,
                    "currencyCode": "USD"
                },
                "totalAmount": {
                    "amount": 1000,
                    "currencyCode": "USD"
                }
            }
        ]
    }
}